#Задача «Площадь прямоугольного треугольника»
#Условие
#Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике
#и выводит его площадь (=1/2bh).
#Каждое число записано в отдельной строке.

# Числа b и h можно считывать так:
b = int(input()) #ввод 1 числа с преобразованием в тип Integer
h = int(input()) #ввод 2 числа с преобразованием в тип Integer
s=1/2*b*h        #вычисление площади
print(s)         #вывод результата

