#Задача «Сумма трёх чисел»
#Условие
#Напишите программу, которая считывает три числа и выводит их сумму.
#Каждое число записано в отдельной строке.

a = int(input()) #ввод 1 числа с преобразованием в тип Integer
b = int(input()) #ввод 2 числа с преобразованием в тип Integer
c = int(input()) #ввод 3 числа с преобразованием в тип Integer
print(a + b + c) #вывод результата - суммы 3-х чисел
